DessertHunter/antFGM/Keil µVision5/nRF51422/Application/main.c
//!
//! Copyright 2016 DessertHunter
//!
/* Copyright (c) 2013 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

#define ENABLE_BLE_SRV_HRS  0 ///< BLE Heart Rate Service
#define ENABLE_BLE_SRV_GLS  0 ///< BLE Glucose Service
#define ENABLE_BLE_SRV_BAS  0	///< BLE Battery Service

/** @file
 *
 * @defgroup ble_sdk_app_ant_hrs_main main.c
 * @{
 * @ingroup ble_sdk_app_ant_hrs
 * @brief HRM sample application using both BLE and ANT.
 *
 * The application uses the BLE Heart Rate Service (and also the Device Information
 * services), and the ANT HRM RX profile.
 *
 * It will open a receive channel which will connect to an ANT HRM TX profile device when the
 * application starts. The received data will be propagated to a BLE central through the
 * BLE Heart Rate Service.
 *
 * The ANT HRM TX profile device simulator SDK application
 * (Board\pca10003\ant\ant_hrm\hrm_tx_buttons) can be used as a peer ANT device. By changing
 * ANT_HRMRX_NETWORK_KEY to the ANT+ Network Key, the application will instead be able to connect to
 * an ANT heart rate belt.
 *
 * @note The ANT+ Network Key is available for ANT+ Adopters. Please refer to
 *       http://thisisant.com to become an ANT+ Adopter and access the key.
 *
 * @note This application is based on the BLE Heart Rate Service Sample Application
 *       (Board\nrf6310\ble\ble_app_hrs). Please refer to this application for additional
 *       documentation.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "nrf_log.h"
#include "nrf.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#if (ENABLE_BLE_SRV_HRS == 1)
#include "ble_hrs.h"
#endif // NABLE_BLE_SRV_HRS
#if (ENABLE_BLE_SRV_GLS == 1)
#include "ble_gls.h"
#include "ble_racp.h"
#endif // NABLE_BLE_SRV_GLS
#if (ENABLE_BLE_SRV_BAS == 1)
#include "ble_bas.h"
#endif // NABLE_BLE_SRV_BAS
#include "ble_dis.h"
#include "ble_conn_params.h"
#include "boards.h"
#include "sensorsim.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "device_manager.h"
#include "ant_parameters.h"
#include "ant_interface.h"
#include "pstorage.h"
#include "app_trace.h"
#include "app_util.h"
#include "bsp.h"
#include "ant_error.h"
#include "ant_stack_config.h"
#include "ant_key_manager.h"
#include "ant_state_indicator.h"
#include "SEGGER_RTT.h"
#include "main_Secret.h"


#define CR95HF_IS_ATTACHED              1

#if (CR95HF_IS_ATTACHED == 1)
#include "CR95HF.h"
#define CR95HF_DEFAULT_TIMEOUT_MS       1000
#define CR95HF_READ_MAX_RETRY_CNT       3
#define CR95HF_BSP_USER_STATE           BSP_INDICATE_USER_STATE_1   // Gruene LED
#endif // CR95HF_IS_ATTACHED

#include "LibreSensor.h"


#define ANT_FGM_APP_VERSION             100  /**< Application Version (Major=VERSION / 100; Minor=VERSION % 100) */
#define STR_HELPER(x) #x
#define STR(x) STR_HELPER(x)


#define ENABLE_ANT_FGM                  1
#if (ENABLE_ANT_FGM == 1)
#include "ANT_FGM.h"
#endif // ENABLE_ANT_FGM


#define WAKEUP_BUTTON_ID               	0                                            /**< Button used to wake up the application. */
#define BOND_DELETE_ALL_BUTTON_ID       1                                            /**< Button used for deleting all bonded centrals during startup. */


#define DEVICE_NAME                     "antFGM (V" STR(ANT_FGM_APP_VERSION) ")"     /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME               "DessertHunter@GitHub"                       /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                40                                           /**< The advertising interval (in units of 0.625 ms. This value corresponds to 25 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      180                                          /**< The advertising timeout in units of seconds. */

#define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                            /**< Whether or not to include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device */
#define APP_TIMER_PRESCALER             0                                            /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE         4                                            /**< Size of timer operation queues. */

#define SECOND_1_25_MS_UNITS            800                                          /**< Definition of 1 second, when 1 unit is 1.25 ms. */
#define SECOND_10_MS_UNITS              100                                          /**< Definition of 1 second, when 1 unit is 10 ms. */
#define MIN_CONN_INTERVAL               (SECOND_1_25_MS_UNITS / 2)                   /**< Minimum acceptable connection interval (0.5 seconds), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               (SECOND_1_25_MS_UNITS)                       /**< Maximum acceptable connection interval (1 second), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                            /**< Slave latency. */
#define CONN_SUP_TIMEOUT                (4 * SECOND_10_MS_UNITS)                     /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)   /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)  /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                            /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_TIMEOUT               30                                           /**< Timeout for Pairing Request or Security Request (in seconds). */
#define SEC_PARAM_BOND                  1                                            /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                            /**< Man In The Middle protection not required. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                         /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                            /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                            /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                           /**< Maximum encryption key size. */

#define DEAD_BEEF                       0xDEADBEEF                                   /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */


#if (ENABLE_ANT_FGM == 1)
#define FGM_CHANNEL_NUMBER       0x00    /**< Channel number assigned to FGM profile. */
#define FGM_DEVICE_NUMBER        123u    /**< Denotes the used ANT device number. 1 � 65535 (0 for searching) Set the Device Number parameter to zero to allow wildcard matching. Once the device number is learned, the receiving device should remember the number for future searches. */
//      FGM_DEVICE_TYPE          99u     /**< Selbst festgelegt */
#define FGM_TRANSMISSION_TYPE    1u      /**< Denotes the used ANT transmission type. */
// #define FGM_MSG_PERIOD_4Hz    0x1F86u ///< Default Message period, decimal 8070 (4.06 Hz).
#define FGM_NETWORK_NUMBER       0u      /**< Default Network Number */
#define FGM_ANTPUBLIC_RF_FREQ    60u     /**<*Provisory* ANT FGM RF Freq 2460 MHz */

#define FGM_MFG_ID               255u    /**< Manufacturer ID. he value 255 (0x00FF) has been reserved as a development ID and may be used by manufacturers that have not yet been assigned a value. */
#define FGM_SERIAL_NUMBER        0xABCDu /**< Serial Number. */
#define FGM_HW_VERSION           5u      /**< HW Version. */
#define FGM_SW_VERSION           ANT_FGM_APP_VERSION   /**< SW Version. */
#define FGM_MODEL_NUMBER         2u      /**< Model Number. */

#endif // ENABLE_ANT_FGM


#if (ENABLE_ANT_FGM == 1)
/** @snippet [ANT FGM TX Instance] */
void ant_fgm_evt_handler(ant_fgm_profile_t * p_profile, ant_fgm_evt_t event);

FGM_SENS_CHANNEL_CONFIG_DEF(m_ant_fgm,
                            FGM_CHANNEL_NUMBER,
                            FGM_TRANSMISSION_TYPE,
                            FGM_DEVICE_NUMBER,
                            FGM_NETWORK_NUMBER);
FGM_SENS_PROFILE_CONFIG_DEF(m_ant_fgm,
                            true, // PAGE_1_PRESENT
                            ANT_FGM_PAGE_0,
                            ant_fgm_evt_handler);

static ant_fgm_profile_t m_ant_fgm;
/** @snippet [ANT FGM TX Instance] */
#endif // ENABLE_ANT_FGM


static uint16_t               m_conn_handle = BLE_CONN_HANDLE_INVALID;     /**< Handle of the current connection. */
static ble_gap_adv_params_t   m_adv_params;                                /**< Parameters to be passed to the stack when starting advertising. */

