DessertHunter/antFGM/Keil µVision5/nRF51422/Application/main.c
#if (ENABLE_BLE_SRV_HRS == 1)
static ble_hrs_t              m_hrs;                                       /**< Structure used to identify the heart rate service. */
#endif // NABLE_BLE_SRV_HRS

#if (ENABLE_BLE_SRV_GLS == 1)
static ble_gls_t              m_gls;                                      /**< Structure used to identify the glucose service. */
#endif // NABLE_BLE_SRV_GLS

static uint8_t                m_ant_network_key[] = ANT_PUBLIC_NETWORK_KEY; /**< ANT Public network key. */

#ifdef BONDING_ENABLE
static dm_application_instance_t        m_app_handle;                                /**< Application identifier allocated by device manager */
static bool                             m_app_initialized   = false;                 /**< Application initialized flag. */
#endif // BONDING_ENABLE

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    bsp_indication_set(BSP_INDICATE_FATAL_ERROR);
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Start advertising.
 */
static void ble_advertising_start(void)
{
    uint32_t err_code;

    err_code = sd_ble_gap_adv_start(&m_adv_params);
    if (err_code != NRF_SUCCESS && err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_HANDLER(err_code);
    }

    err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    APP_ERROR_CHECK(err_code);
}


#if (ENABLE_ANT_FGM == 1)
/**@brief Function for handling ANT FGM events.
 */
/** @snippet [ANT FGM simulator call] */
void ant_fgm_evt_handler(ant_fgm_profile_t * p_profile, ant_fgm_evt_t event)
{
    switch (event)
    {
        case ANT_FGM_PAGE_0_UPDATED:
            /* fall through */
        case ANT_FGM_PAGE_1_UPDATED:
            /* fall through */
        case ANT_FGM_PAGE_2_UPDATED:
            /* fall through */
        case ANT_FGM_PAGE_3_UPDATED:
            /* fall through */
        case ANT_FGM_PAGE_4_UPDATED:
					// TODO: ant_fgm_simulator_one_iteration(&m_ant_fgm_simulator);
            break;

        default:
            break;
    }
}
#endif // ENABLE_ANT_FGM

/**@brief Attempt to both open the ant channel and start ble advertising.
*/
static void ant_and_ble_adv_start(void)
{
    ble_advertising_start();

	// TODO: Hier Channel �ffnen
}


/**@brief Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
}


/**@brief GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void ble_gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME, strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Advertising functionality initialization.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void ble_advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    uint8_t       flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    ble_uuid_t adv_uuids[] =
    {
        {BLE_UUID_HEART_RATE_SERVICE,         BLE_UUID_TYPE_BLE},
        {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
    };

    // Build and set advertising data.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = flags;
    advdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = adv_uuids;

    err_code = ble_advdata_set(&advdata, NULL);
    APP_ERROR_CHECK(err_code);

    // Initialise advertising parameters (used when starting advertising).
    memset(&m_adv_params, 0, sizeof(m_adv_params));

    m_adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    m_adv_params.p_peer_addr = NULL;
    m_adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    m_adv_params.interval    = APP_ADV_INTERVAL;
    m_adv_params.timeout     = APP_ADV_TIMEOUT_IN_SECONDS;
}


/**@brief Initialize services that will be used by the application.
 *
 * @details Initialize the Heart Rate and Device Information services.
 */
static void ble_services_init(void)
{
    uint32_t       err_code;

#if (ENABLE_BLE_SRV_HRS == 1)
    ble_hrs_init_t hrs_init;
    uint8_t        body_sensor_location;
	#endif // NABLE_BLE_SRV_HRS

#if (ENABLE_BLE_SRV_GLS == 1)
    ble_gls_init_t gls_init;
#endif // NABLE_BLE_SRV_GLS

#if (ENABLE_BLE_SRV_BAS == 1)
		ble_bas_init_t bas_init;
#endif // NABLE_BLE_SRV_BAS

