DessertHunter/antFGM/Keil µVision5/nRF51422/Application/main.c
    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}
#endif // BONDING_ENABLE


/**@brief BLE + ANT stack initialization.
 *
 * @details Initializes the SoftDevice and the stack event interrupt.
 */
static void ble_ant_stack_init(void)
{
    uint32_t                err_code;

    // Initialize SoftDevice
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, NULL);

    // Initialize BLE stack
    ble_enable_params_t ble_enable_params;
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));
    ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
    err_code = sd_ble_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Subscribe for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Subscribe for ANT events.
		err_code = softdevice_ant_evt_handler_set(ant_evt_dispatch);
		APP_ERROR_CHECK(err_code);

#ifdef BONDING_ENABLE
    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
#endif // BONDING_ENABLE
}


/** @snippet [ANT HRM simulator call] */

/**
 * @brief Function for HRM profile initialization.
 *
 * @details Initializes the HRM profile and open ANT channel.
 */
static void profile_setup(void)
{
	uint32_t err_code;

#if (ENABLE_ANT_FGM == 1)
/** @snippet [ANT FGM Profile Setup] */
	err_code = ant_fgm_sens_init(&m_ant_fgm,
															 FGM_SENS_CHANNEL_CONFIG(m_ant_fgm),
															 FGM_SENS_PROFILE_CONFIG(m_ant_fgm));
	APP_ERROR_CHECK(err_code);

	m_ant_fgm.FGM_PROFILE_manuf_id   = FGM_MFG_ID;
	m_ant_fgm.FGM_PROFILE_serial_num = FGM_SERIAL_NUMBER;
	m_ant_fgm.FGM_PROFILE_hw_version = FGM_HW_VERSION;
	m_ant_fgm.FGM_PROFILE_sw_version = FGM_SW_VERSION;
	m_ant_fgm.FGM_PROFILE_model_num  = FGM_MODEL_NUMBER;

	err_code = ant_fgm_sens_open(&m_ant_fgm);
	APP_ERROR_CHECK(err_code);

	err_code = ant_state_indicator_channel_opened();
	APP_ERROR_CHECK(err_code);
	NRF_LOG_PRINTF("ANT FGM Channel is now open (%X)\r\n", err_code);
/** @snippet [ANT FGM Profile Setup] */
#endif // ENABLE_ANT_FGM
}


/**@brief Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code;

    // Wait for events
    err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    // Initialize peripherals
    timers_init();

    // Initialize S310 SoftDevice
    ble_ant_stack_init();

    err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), NULL);
    APP_ERROR_CHECK(err_code);
    // err_code = bsp_buttons_enable((1 << WAKEUP_BUTTON_ID) | (1 << BOND_DELETE_ALL_BUTTON_ID));
    // APP_ERROR_CHECK(err_code);

    // Initialize Bluetooth stack parameters.
    ble_gap_params_init();
    ble_advertising_init();
    ble_services_init();

#if (ENABLE_BLE_SRV_HRS == 1)
    ble_hrm_conn_params_init();
#endif // NABLE_BLE_SRV_HRS

#if (ENABLE_BLE_SRV_GLS == 1)
    ble_gls_conn_params_init();
#endif // NABLE_BLE_SRV_GLS


    //utils_setup();
    softdevice_setup();

#if (ENABLE_ANT_FGM == 1)
    ant_state_indicator_init(m_ant_fgm.channel_number, FGM_SENS_CHANNEL_TYPE);
#endif // ENABLE_ANT_FGM

    profile_setup();


#ifdef BONDING_ENABLE
    uint32_t count;

    // Initialize device manager.
    device_manager_init();

    err_code = pstorage_access_status_get(&count);
    if ((err_code == NRF_SUCCESS) && (count == 0))
#endif // BONDING_ENABLE
    {
        ant_and_ble_adv_start();
    }

#if (CR95HF_IS_ATTACHED == 1)
	NRF_LOG_PRINTF("Init CR95HF!");
	UNUSED_VARIABLE(bsp_indication_set(CR95HF_BSP_USER_STATE));
	initCR95HF();
	wakeCR95HF(CR95HF_DEFAULT_TIMEOUT_MS); // Wichtig, sonst ist �berhaupt keine Kommunikation m�glich
	CR95HF_IDN tChipIdentify;
	identifyCR95HF(&tChipIdentify, CR95HF_DEFAULT_TIMEOUT_MS);
	NRF_LOG_PRINTF("CR95HF Identifikation '%s' (CRC=%X)\r\n", tChipIdentify.deviceID, tChipIdentify.romCRC);
	UNUSED_VARIABLE(bsp_indication_set(BSP_INDICATE_USER_STATE_OFF));
#endif // CR95HF_IS_ATTACHED

    // Enter main loop.
    for (;;)
		{


			// - Sensor State in ANT: In Range, order Fehler z.B. ERecvLost 0x8E // When reception is lost without EOF received (or subcarrier was lost)
			// - Fehler oder Error Rate? sozusagen ein Retry-Z�hler als Art Qualityidicator
			// - Fehler/Erfolgsverh�ltnis?
			// - Batteriestand
			// - Sensorrestlaufzeit bzw. Fehler wenn abgelaufen

#if (CR95HF_IS_ATTACHED == 1)
			UNUSED_VARIABLE(bsp_indication_set(CR95HF_BSP_USER_STATE));

			CR95HF_STATES nfc_state = getStateCR95HF();

#if (ENABLE_ANT_FGM == 1)
			// Neuer Status...
			m_ant_fgm.FGM_PROFILE_nfc_state = (uint8_t)nfc_state;
#endif // ENABLE_ANT_FGM

			if (nfc_state == CR95HF_STATE_UNKNOWN)
			{
				// Startsequenz mit Reset versuchen...
				wakeCR95HF(CR95HF_DEFAULT_TIMEOUT_MS); // Wichtig, sonst ist �berhaupt keine Kommunikation m�glich
				//resetCR95HF(); // send a reset command just in case the cr95hf hasn't been powered off
				//echoCR95HF(CR95HF_DEFAULT_TIMEOUT_MS, true); // Um in den Status ANSWERING zu wechseln ist die n�tig!

				nrf_delay_ms(100);
			}
			else if (nfc_state == CR95HF_STATE_ANSWERING)
			{
				// NFC-Chip antwortet
				protocolISO15693_CR95HF(CR95HF_PROTOCOL_ISO_15693_WAIT_FOR_SOF
																| CR95HF_PROTOCOL_ISO_15693_10_MODULATION
																| CR95HF_PROTOCOL_ISO_15693_CRC); // ISO 15693 settings --> 0x0D = Wait for SOF, 10% modulation, append CRC
			}
			else if ((nfc_state == CR95HF_STATE_PROTOCOL) || (nfc_state == CR95HF_STATE_TAG_IN_RANGE))
			{
				// Tags k�nnen jetzt gelesen werden... versuchen:
				static CR95HF_TAG stKnownNfcTag;
				CR95HF_TAG tFoundNfcTag;
				bool fIsNewFoungTag = false;
				if (inventoryISO15693_CR95HF(&tFoundNfcTag, CR95HF_DEFAULT_TIMEOUT_MS)) // sensor in range?
				{
					// Ja, Sensor gefunden!
					if (0 != memcmp(stKnownNfcTag.uid, tFoundNfcTag.uid, sizeof(tFoundNfcTag.uid)))
					{
						NRF_LOG_PRINTF("Neuer Sensor gefunden UID: %#02x:%#02x:%#02x:%#02x:%#02x:%#02x:%#02x:%#02x!\r\n",
						               tFoundNfcTag.uid[0], tFoundNfcTag.uid[1], tFoundNfcTag.uid[2], tFoundNfcTag.uid[3], tFoundNfcTag.uid[4], tFoundNfcTag.uid[5], tFoundNfcTag.uid[6], tFoundNfcTag.uid[7]);
						stKnownNfcTag = tFoundNfcTag;
						fIsNewFoungTag = true;


