DessertHunter/antFGM/Keil µVision5/nRF51422/Application/main.c
#if (ENABLE_BLE_SRV_HRS == 1)
						// BLE HRS Service HRM aktualisieren:
						// TOOD_CS:
						const uint16_t glucose_value = tFoundNfcTag.uid[7]; // Letzte Stelle vom Sensor nehmen
						ble_hrs_update_heart_rate(glucose_value);
#endif // NABLE_BLE_SRV_HRS

#if (ENABLE_BLE_SRV_GLS == 1)

#endif // NABLE_BLE_SRV_GLS
					}

					bool fReadAllOk = true;
					uint8_t au8SensorRawData[LIBRE_SENSOR_RAW_DATA_LENGTH];
					for (uint8_t adr = LIBRE_SENSOR_RAW_DATA_START_BLOCK; adr <= LIBRE_SENSOR_RAW_DATA_END_BLOCK; adr++)
					{
						int len = readSingleCR95HF(adr, &au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE], LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE, CR95HF_DEFAULT_TIMEOUT_MS, CR95HF_READ_MAX_RETRY_CNT);
						if (LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE != len)
						{
							// Fehler
							NRF_LOG_DEBUG("Fehler beim Lesen!\r\n");
							fReadAllOk = false;
							break;
						}

						if (fIsNewFoungTag)
						{
							// Falls es ein neuer Sensor ist, dessen Daten ausgeben:
							NRF_LOG_PRINTF("block %#04d: %#02x %#02x %#02x %#02x %#02x %#02x %#02x %#02x\r\n", adr,
														 au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+0],
														 au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+1],
														 au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+2],
														 au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+3],
														 au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+4],
														 au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+5],
														 au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+6],
														 au8SensorRawData[(adr - LIBRE_SENSOR_RAW_DATA_START_BLOCK) * LIBRE_SENSOR_RAW_DATA_BLOCK_SIZE+7]);
						}
					}

					if (fReadAllOk)
					{
						// Ok, alle Daten eingelesen
						ST_LibreSensorData tSensorData;
						if (LibreSensor_ParseSensorData(tFoundNfcTag.uid, &au8SensorRawData[0], sizeof(au8SensorRawData), &tSensorData))
						{
							// Parsen ok
							if (fIsNewFoungTag)
							{
								NRF_LOG_PRINTF("sensor_id: '%s'\r\n", tSensorData.sensor_id);
							}
							
#if (ENABLE_ANT_FGM == 1)
							// Neue Messung...
							m_ant_fgm.FGM_PROFILE_meas_glucose = tSensorData.current_glucose;
							m_ant_fgm.FGM_PROFILE_meas_time_offset++;
							m_ant_fgm.FGM_PROFILE_meas_prediction = tSensorData.trend_prediction;
							m_ant_fgm.FGM_PROFILE_meas_climb_sink_rate = tSensorData.glucose_climb_sink_rate;
							m_ant_fgm.FGM_PROFILE_meas_sequence_num++;
#endif // ENABLE_ANT_FGM
						}
					}

				}
				//if (getStateCR95HF() == CR95HF_STATE_ANSWERING)
				//{
					// TODO: goToSleep (0b100001, sleepTime);
					// TODO: wakeUp();
						// nrf_delay_ms(100);
				//}
			}
			else // nfc_state ???
			{
				// TODO: String xdripPacket = Build_Packet(Read_Memory());
				// TODO: Send_Packet(xdripPacket);
				// TODO: goToSleep (0b100001, sleepTime);

				// TODO: wakeCR95HF(100);
				nrf_delay_ms(100);
			}
			UNUSED_VARIABLE(bsp_indication_set(BSP_INDICATE_USER_STATE_OFF));
#endif // CR95HF_IS_ATTACHED


			  NRF_LOG_DEBUG(".");
        nrf_delay_ms(10000); // nur alle 10s auslesen!

        power_manage();
    }
}

/**
 * @}
 */
